Tekla Open API Reference for Tekla Structures 2025
IIntDataType Properties
The IIntDataType type exposes the following members.
Properties
Name | Description
Value
 The integer value of the field.
Top
See Also
Reference
IIntDataType Interface
Tekla.Structures.Datatype Namespace